Repository: seanpm2001/mt-training-data
Catalog: tn/tn_pontoon.tmx
Source language: en_us
Languages: tn

source: Maybe our <homepageLink>homepage</homepageLink> will help? To ask a question, please join the <matrixLink>Matrix community chat</matrixLink>, monitor site issues via <githubLink>GitHub</githubLink> or visit <discourseLink>our Discourse forums</discourseLink>.
tn: Gongwe <homepageLink>tsebe ya rona ya tshimologo</homepageLink> e tla thusa? Go botsa potso, tsweetswee nna karolo ya <matrixLink>puisano ya morafe wa Matrix</matrixLink>, tlhokomela dikgang tsa webosaete ka <githubLink>GitHub</githubLink> kgotsa etela <discourseLink>diforamo tsa rona tsa Discourse</discourseLink>.

source: Meadow Mari
tn: Se-Meadow Mari

source: Meetei Lon
tn: Se-Meetei Lon

source: Message
tn: Molaetsa

source: [Mismatched content]
tn: [Diteng tse di sa tshwaneng]

source: Misreadings
tn: Tse di sa balwang sentle

source: Missing an <strong>'s'</strong> at the end of a word.
tn: Go tlhaela <strong>'ng'</strong> kwa bofelong jwa lefoko.

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
tn: Ga go na <strong>'A'</strong> kgotsa <strong>'Le'</strong> kwa tshimologong ya kgatiso.

source: Missing the end of the last word by cutting off the recording too quickly.
tn: Go tlhaela lefoko la bofelo fa le felela ka ntlha ya go khutlisa kgatiso ka bonako.

source: Mixed
tn: E kopane

source: Moksha
tn: Se-Moksha

source: Mongolian
tn: Se-Mongolia

source: More
tn: Mo go Oketsegileng

source: [More has been recorded than the required text]
tn: [Go gatisitswe mo gontsi go gaisa mokwalo o o tlhokegang]

source: Mossi
tn: Se-Mossi

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Common Voice, a project to help make voice recognition open and accessible to everyone.
tn: Batho ba bantsi ga ba kgone go fitlhelela bontsi jwa tshedimosetso e e dirisiwang ke dikhampani tse dikgolo. Re akanya gore seo se kgoreletsa go tlhama dilo. Ka jalo re simolotse Common Voice, porojeke e e thusang gore mongwe le mongwe a kgone go bona le go fitlhelela temogo ya mantswe.

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Project Common Voice, a project to help make voice recognition open to everyone.
tn: Batho ba bantsi ga ba kgone go fitlhelela bontsi jwa tshedimosetso e e dirisiwang ke dikhampani tse dikgolo. Re akanya gore seo se kgoreletsa go tlhama dilo. Ka jalo re simolotse Project Common Voice, porojeke e e thusang gore mongwe le mongwe a kgone go bona temogo ya mantswe.

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
tn: Dikgatiso tse dintsi ke tsa batho ba ba buang ka lentswe la bone la tlholego. O ka amogela kgatiso nngwe e e sa tlwaelegang ya go goa, go seba, kgotsa e e buiwang ka tsela e e ‘kgatlhang’. Tsweetswee gana dikgatiso tse go opelwang le tse di dirisang lentswe le le dirilweng ka khomputara.

source: Most speech databases are trained with an overrepresentation of certain demographics which results in a bias towards <articleLink>male and middle class</articleLink>. Accents and dialects that tend to be under-represented in training data sets are typically associated with groups of people who are already marginalised. Many machines also struggle to understand female voices. This is why in our voice database we want variety!
tn: Tshedimosetso e ntsi ya puo e thapisiwa ka go gatelela thata dipalopalo tse di rileng, se se felelang ka go tsaya letlhakore mo <articleLink>setlhopheng sa banna le se se mo magareng</articleLink>. Digalo le medumo e e sa gatelelweng mo tshedimosetsong ya go thapisa gantsi di amanngwa le batho ba ba setseng ba tseelwa kwa tlase. Gape metšhine e mentsi e thatafalelwa ke go tlhalogaya mantswe a basadi. Ke gone ka moo re batlang mefuta e e farologaneng mo tshedimosetsong ya rona!

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
tn: Mozilla Common Voice ke letsholo la go thusa go ruta metšhine gore batho ba mmatota ba bua jang.

source: Mozilla Common Voice is made possible by a diverse community of activists, linguists, data scientists, academics and software engineers from all over the world. The project is stewarded by the Mozilla Foundation.
tn: Mozilla Common Voice e kgonega ka ntlha ya balweladiphetogo, baitsepuo, baitsesaense ba tshedimosetso, barutegi le banjenere ba dirweboleta go ralala lefatshe. Porojeke e etelelwa pele ke Mozilla Foundation.

source: Mozilla is dedicated to keeping the web open and accessible for everyone. To do that we need to empower web creators through projects like Common Voice. As voice technologies proliferate beyond niche applications, we believe they must serve all users equally. That means investing in more languages and accommodating diverse accents and demographics when building and testing voice technologies. Common Voice is a public resource available to everyone and Mozilla teams and developers around the world are already using it on our own projects as well.
tn: Mozilla e batla go boloka webosaete e bulegetse mongwe le mongwe e bile e kgona go fitlhelesega. Go dira jalo, re tlhoka go matlafatsa badiri ba webosaete ka diporojeke tse di jaaka Common Voice. Fa dithekenoloji tsa mantswe di ntse di oketsega go feta dithulaganyo tse di tswalegileng, re dumela gore di tshwanetse go direla batho botlhe ka go lekana. Seo se raya go beeletsa mo dipuong tse dintsi le go dirisana le digalo tse di farologaneng le dipalopalo fa ba dira le go tlhatlhoba dithekenoloji tsa mantswe. Common Voice ke sedirisiwa se mongwe le mongwe le ditlhopha tsa Mozilla le badiri go ralala lefatshe ba setse ba se dirisa le mo diporojekeng tsa rona.

source: Mozilla’s open source voice recognition engine Deep Speech can be used to build speech recognition applications. Read our <githubLink>Github overview</githubLink> or join the <discourseLink>DeepSpeech Discourse</discourseLink> to learn how to get started.
tn: Thulaganyo ya go lemoga mantswe ya Mozilla ya Deep Speech e ka dirisiwa go dira dithulaganyo tsa go lemoga puo. Bala <githubLink>dintlhakakaretso tsa rona tsa Github</githubLink> kgotsa nna karolo ya <discourseLink>DeepSpeech Discourse</discourseLink> go ithuta gore o ka simolola jang.

source: Mutual accountability.
tn: Maikarabelo a maphata ka bobedi.

source: My Sentences
tn: Mela ya Me

source: N/A
tn: Ga e yo

source: Name
tn: Leina

source: Names of your language
tn: Maina a puo ya gago

source: Native Language
tn: Puo ya Kwa Gae

source: Need some help with accent?
tn: A o tlhoka thuso ka puo?

source: Need some help with variants?
tn: A o tlhoka thuso ka dipharologano mo puong?

source: Need to download your data?
tn: A o tlhoka go itseela tshedimosetso ya gago?

source: Nepali
tn: Se-Nepal

source: New Language Launch
tn: Go Thankgolola Puo e Ntšha

source: Next
tn: E e Latelang

source: Next Goals: { $goal }
tn: Maikaelelo a a Latelang: { $goal }

source: Nias
tn: Se-Nias

source: No
tn: Nyaa

source: [No ‘a’ in the original text]
tn: [Ga go na ‘a’ mo mafokong a ntlhantlha]

source: No gravatar found for your email
tn: Ga go a bonwa setshwantsho sepe se se amanang le imeile ya gago

source: No microphone found.
tn: Ga go a fitlhelwa maekerofouno ope.

source: No rejected sentences found!
tn: Ga go a fitlhelwa dipolelo dipe tse di gannweng!

source: Northern Sotho
tn: Sesotho sa Bokone

source: Norwegian Bokmål
tn: Se-Bokmål sa kwa Norway

source: Norwegian Nynorsk
tn: Se-Norwegian Nynorsk

source: No sentences found!
tn: Ga go a bonwa mela epe!

source: No sentences to review. <addLink>Add more sentences now!</addLink>
tn: Ga go na mela e e tlhokang go sekasekiwa. <addLink>Tsenya mela e e oketsegileng jaanong!</addLink>

source: Note: When set to 'Visible', this setting can be changed from the <profileLink>Profile page</profileLink>
tn: Ela tlhoko: Fa e beilwe mo go 'Bonagala', o ka kgona go fetola seting eno mo <profileLink>tsebeng ya Porofaele</profileLink>

source: Note: You will still need to select between Speak or Listen to change contribution type.
tn: Ela tlhoko: O santse o tlhoka go tlhopha magareng ga Bua kgotsa Reetsa gore o fetole botsayakarolo jwa gago.

source: No Thanks
tn: Nyaa ke Siame

source: No variant selected
tn: Ga go na mofuta o o tlhophilweng

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. You’ll help confirm that recordings match the sentences written on screen.
tn: E re ka jaanong o itse go le gontsinyana ka Common Voice, goreng o sa e leke? Tobetsa letshwao la maekerofouno go simolola go balela dipolelo kwa godimo. <br/><br/>Fa o rata go sekaseka diabo tsa mantswe a batho ba bangwe, tobetsa letshwao la tshameka. O tla thusa go tlhomamisa gore a dikgatiso di tsamaisana le mela e e kwadilweng mo sekerining.

source: Now you can donate your voice to help us build an open-source voice database that anyone can use to make innovative apps for devices and the web. Read a sentence to help machines learn how real people speak. Check the work of other contributors to improve the quality. It’s that simple!
tn: Jaanong o ka re fa lentswe la gago go re thusa go dira tshedimosetso ya mantswe e mongwe le mongwe a ka e dirisang go dira dithulaganyo tsa didirisiwa le webosaete. Bala polelo go thusa motšhine go ithuta gore batho ba bua jang. Leba tiro ya baabi ba bangwe go tokafatsa boleng. Go motlhofo fela jalo!

source: Number of Voices
tn: Palo ya Mantswe

source: Numbers. There should be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
tn: Dinomoro. Ga go a tshwanela ga nna le dinomoro mo mokwalong gonne di ka baka mathata fa go balelwa kwa godimo. Tsela e nomoro e balwang ka one e ikaegile ka se go buiwang ka sone mme e ka tlhakatlhakanya tshedimosetso. Ka seka, nomoro “2409” e ka balwa ka nepo e le “masomeamabedinne lefela robongwe” le ”dikete tse pedi makgolo a mane le borobongwe”.

source: Occitan
tn: Se-Occitan

source: Odia
tn: Se-Odia

source: Off
tn: E timile

source: Offensive language
tn: Puo e e kgopisang

source: Offensive speech
tn: Puo e e kgopisang

source: On
tn: E tshubile

source: Once logged in you can select your languages from the profile section.
tn: Fa o setse o tsene, o kgona go tlhopha dipuo tsa gago mo karolong ya porofaele.

source: On desktop devices you can contribute by downloading…
tn: Mo didirisiweng tsa desekethopo, o ka tsaya karolo ka go itseela...

source: One sentence per line
tn: Polelo e le nngwe mo moleng

source: On his head he wore a beret.
tn: Mo tlhogong ya gagwe o ne a rwele berethe.

source: On iOS please continue with Safari to enable recording…
tn: Mo iOS tsweetswee tswelela ka Safari go dira gore e kgone go gatisa…

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
tn: Kafa letlhakoreng le lengwe, fa o akanya gore gongwe mmadi ga a ise a kopane le lefoko leo, mme o fopholetsa fela ka tsela e e sa siamang tsela e le bidiwang ka yone, tsweetswee e gane. Fa o sa tlhomamisege, dirisa konopo ya tlola.

source: Optionally join on our email list for updates and new information about the project.
tn: O ka itlhophela go tsena mo lenaaneng la diimeile tse re di romelelang ditlhabololo le tshedimosetso e ntšha ka porojeke eno.

source: Optionally submitted demographic data (e.g. age, gender, language, and accent) will never be made public on your profile, and will not be linked to your account in the dataset. Individual audio clips will be associated with demographic data for the purpose of more accurate analysis - for example, a researcher might want to target a training model to a specific demographic segment.
tn: Tshedimosetso e o re fileng yone ka go ithaopa (s.k. dingwaga, bong, puo, le teme) e ka se phasaladiwe mo porofaeleng ya gago, e bile e ka se amanngwe le akhaoto ya gago mo databeiseng ya rona. Dikgatiso tsa mantswe di tla amanngwa le tshedimosetso ka batho ba ba rileng ka maikaelelo a go nepisisa ka tlhomamo tshekatsheko e e dirwang - ka sekai, mmatlisisi a ka tswa a batla go dira katiso e e rileng mo mofuteng o o rileng wa batho.

source: Other
tn: Yo mongwe

source: Other Language
tn: Pou e Nngwe

source: Other people validate those voice clips.
tn: Batho ba bangwe ba tlhomamisa dkgatiso tseo tsa mantswe.

source: Other voice datasets…
tn: Direkoto tse dingwe tsa tshedimosetso ya mantswe...

source: Other Voice Datasets
tn: Direkoto Tsa Tshedimosetso Tsa Mantswe Tse Dingwe

source: Our community manager will reach out to you to offer extra support, and to let you know if there is already a community working on your language
tn: Motsamaisi wa morafe wa rona o tla ikgolaganya le wena go go naya tshegetso e e oketsegileng, le go go itsise gore a go batho ba ba berekang ka puo ya gago

source: Our governance is founded on the pillars of:
tn: Bolaodi jwa rona bo theilwe mo dipilareng tsa:

source: Our source text is made up of original contributor donations as well as dialogue from public domain movie scripts like <italic>It’s a Wonderful Life</italic>. You can view our source sentences in this <githubLink>GitHub folder</githubLink>.
tn: Mokwalo wa rona o dirilwe ka dikabo tsa mmatota le dipuisano tsa mekwalo ya difilimi jaaka <italic>It’s a Wonderful Life</italic>. O ka leba dipolelo tsa rona mo faeleng eno ya <githubLink>GitHub</githubLink>.

source: Overall Accuracy
tn: Go Nepa ka Kakaretso

source: Overall Hr. Total
tn: Palogotlhe ya Diura Tsotlhe

source: Overall project status: see how far we’ve come!
tn: Seemo sa porojeke ka kakaretso: bona gore re tswa kgakala jang!

source: p
tn: t

source: Papiamento (Aruba)
tn: Se-Papiamento (Aruba)

source: Partners
tn: Balekane

source: Partnerships and networks
tn: Ditirisanommogo le dineteweke

source: Partner with local organizations or individuals
tn: Dirisana le mekgatlho ya selegae kgotsa batho ba ba ikemetseng

source: [Part of the text can’t be heard]
tn: [Karolo ya mokwalo ga e utlwale]

source: Pashto
tn: Se-Pashto

source: Past recordings download requests
tn: Dikopo tsa go itseela dikgatiso tse di fetileng

source: <p>Common Voice is a publicly available voice dataset, powered by the voices of volunteer contributors around the world. People who want to build voice applications can use the dataset to train machine learning models.</p> <p>At present, most voice datasets are owned by companies, which stifles innovation. Voice datasets also underrepresent: non-English speakers, people of colour, disabled people, women and LGBTQIA+ people. This means that voice-enabled technology doesn’t work at all for many languages, and where it does work, it may not perform equally well for everyone. We want to change that by mobilising people everywhere to share their voice.</p>
tn: <p>Common Voice ke tshedimosetso e e leng teng go batho botlhe, e e matlafadiwang ke mantswe a baabi ba baithaopi lefatshe ka bophara. Batho ba ba batlang go dira dithulaganyo tsa mantswe ba ka dirisa tshedimosetso eo go thapisa mefuta ya metšhine e e kgonang go ithuta.</p> <p>Gone jaanong, ditshedimosetso tse dintsi ke tsa dikhampani, mme seo se kgoreletsa go tlhamiwa. Ditshedimosetso tsa mantswe le tsone di gone mo dikarolong tseno tse di tseelwang kwa tlase: batho ba ba sa bueng Seesemane, batho ba mmala, batho ba ba nang le bogole, basadi le batho ba LGBTQIA+. Seno se raya gore tshedimosetso ya mantswe ga e bereke mo dipuong tse dintsi, mme fa e berekang gone, e ka nna ya se berekele mongwe le mongwe sentle. Re batla go fetola seo ka go kgothaletsa batho gongwe le gongwe go ntsha mantswe a bone.</p>

source: People come and contribute their voices.
tn: Batho ba a tla ba bo ba abelana ka mantswe a bone.

source: Persian
tn: Seperesia

source: Personal
tn: Tsa Botho

source: Personal dashboards keep you up-to-date with individual and community progress.
tn: Didesheboto tsa botho di go thusa gore o nne mo dinakong ka kgatelopele ya batho ka bongwe le ya batho botlhe.

source: <playbookLink>Find helpful guidance</playbookLink> on the entire Common Voice journey, from localisation to dataset usage, as well as how to connect with our community.
tn: <playbookLink>Bona kaelo e e thusang</playbookLink> ka loeto lotlhe lwa Common Voice, go tloga ka go ranolela go fitlha ka tiriso ya tshedimosetso, mmogo le go ikgolaganya le batho ba lefelo la rona.

source: <playIcon></playIcon>Last one!
tn: <playIcon></playIcon>Ya bofelo!

source: Play/Stop
tn: Tshameka/Emisa

source: Please add a source.
tn: Tsweetswee tsenya motswedi.

source: Please add sentences.
tn: Tsweetswee tsenya dipolelo.

source: Please check the <howToLink>guidelines</howToLink>.
tn: Tsweetswee tlhola <howToLink>dikaelo</howToLink>.

source: Please confirm that these sentences are public domain.
tn: Tsweetswee tlhomamisa gore mela eno e mo lefelong la botlhe.

source: Please select a language.
tn: Tsweetswee tlhopha puo.

source: Please select a language to review sentences.
tn: Tsweetswee tlhopha puo go sekaseka mela.

source: Please try again.
tn: Tsweetswee leka gape.

source: Polish
tn: Se-Poland

source: <pontoonAccountLink>Create an account</pontoonAccountLink> if you don’t have one. Then, choose your language <strong>(‘Team’)</strong> and then choose the project, <pontoonCvLink>Common Voice</pontoonCvLink>. There will be files to translate. Click on one, then it shows words in English and a box to translate them.
tn: <pontoonAccountLink>Dira akhaonto</pontoonAccountLink> fa o se na yone. Go tswa foo, tlhopha puo ya gago <strong>(‘Team’)</strong> o bo o tlhopha porojeke, <pontoonCvLink>Common Voice</pontoonCvLink>. Go tla bo go na le difaele tse di ranolwang. Tobetsa mo go e nngwe, mme e tla bontsha mafoko a Seesemane le lebokoso la go a ranola.

source: Portuguese
tn: Sepotokisi

source: Press play, listen & tell us: did they accurately speak the sentence below?
tn: Tobetsa tshameka, reetsa & re bolelele: a ba buile mola o o fa tlase ka tsela e e nepagetseng?

source: Press { shortcut-play-toggle } to toggle play mode
tn: Tobetsa { shortcut-play-toggle } go nna o tshameka

source: Privacy
tn: Bosephiri

source: Privacy Policy
tn: Pholisi ya Polokodiphiri

source: Privacy, security and transparency.
tn: Polokodiphiri, tshireletso le go sa fitlhe sepe.

source: Profile
tn: Porofaele

source: Profile information improves the audio data used in training speech recognition accuracy.
tn: Tshedimosetso ya porofaele e tokafatsa tshedimosetso ya modumo e e dirisiwang go ruta motšhine go kgona go lemoga puo ka nepo.

source: Profile: { $username }
tn: Porofaele: { $username }

source: Progress
tn: Kgatelopele

source: Punctuation. Special symbols and punctuation should only be included when absolutely necessary. For example, an apostrophe is included in English words like “don’t” and “we’re” and should be included in the source text, but it’s unlikely you’ll ever need a special symbol like “@” or “#.”
tn: Matshwao a puiso. Matshwao a a kgethegileng le matshwao a puiso di tshwanetse go tsengwa fela fa tota go tlhokega. Ka sekai, phegelwanagodimo e teng mo mafokong a Seesemane jaaka "don't" le "we're" mme e tshwanetse go akarediwa mo mokwalong wa konokono, mme ga se gantsi o ka tlhokang go dirisa letshwao le lekgethegileng jaaka "@" kgotsa "#".

source: Punjabi
tn: Se-Punjabi

source: Quechua Chanka
tn: Se-Quenchua Chanka

source: [‘Raised’ in English is always pronounced as one syllable, not two]
tn: [Ka dinako tsotlhe ‘Raised’ ka Seesemane o bidiwa e le lefoko le le lengwe, e seng a mabedi]

source: Reader Effects
tn: Seabe sa Mmadi

source: Reading contractions that aren't actually there, such as "We're" instead of "We are", or vice versa.
tn: Go bala mafoko a a seyong, jaaka "Ra" go na le go re "Re a," kgotsa ka tsela e e farologaneng.

source: Read More
tn: Bala mo go Oketsegileng

source: Read more on our About page
tn: Bala mo go oketsegileng mo tsebeng ya Ka Ga

source: Read our How-to if unsure how to attribute
tn: Bala Kafa o Ka fa o sa tlhomamisege gore o ka bona dilo jang

source: Read the sentence carefully - don’t miss, change or add words.
tn: Bala mela ka kelotlhoko - o se ka wa tlola, wa fetola kgotsa wa itsenyetsa mafoko.

source: { $readyCount } sentences ready for submission!
tn: Mela e le { $readyCount } e siametse go romelwa!

source: Ready to add your voice or lend your ear?
tn: A o ipaakanyeditse go tsenya lentswe la gago kgotsa go re adima tsebe?

source: Ready to contribute?
tn: A o ipaakanyeditse go aba?

source: Ready to do { $count } more?
tn: A o ipaakanyeditse go dira { $count } mo go oketsegileng?

source: Ready to donate your voice?
tn: A o ipaakanyeditse go abelana ka lentswe la gago?

source: Ready to help validate sentences?
tn: A o ipaakanyeditse go tlhomamisa mela?

source: reCAPTCHA is required if you want to proceed
tn: reCAPTCHA e a tlhokega fa o batla go tswelela

source: Receive emails such as challenge and goal reminders, progress updates, and newsletters about Common Voice.
tn: Amogela diimeile tse di jaaka dikgwetlho le dikgopotso tsa maikaelelo, ditlhabololo tsa kgatelopele, le makwalodikgang a Common Voice.

source: Recorded Clips
tn: Dikgatiso

source: Recorded Hours
tn: Diura Tse di Gatisitsweng

source: <recordIcon></recordIcon> Last one!
tn: <recordIcon></recordIcon> Ya bofelo!

source: [Recording cut off before the end of the last word]
tn: [Kgatiso e kgaogile pele lefoko la bofelo le felela]

source: Recordings
tn: Dikgatiso

source: Recording voice clips is an integral part of building our open dataset; some would say it's the fun part too.
tn: Go gatisa mantswe ke karolo e e botlhokwa thata e e thusang go aga rekoto ya tshedimosetso; ba bangwe ba ka re gape ke karolo e e itumedisang.

source: Record/Stop
tn: Rekota/Emisa

source: Record your voice
tn: Rekota lentswe la gago

source: Refresh
tn: Ntšhafatsa

source: Reject
tn: Gana

source: Rejected Sentences
tn: Mela e e Gannweng

source: { $rejectedSentences } rejected sentences.
tn: Go gannwe mela e le { $rejectedSentences }.

source: Remember that we need permission to publish those sentences, so always ensure that the text belongs to the <wikipediaLink>public domain</wikipediaLink>. If there is no explicit indication, reach out to the person that the text belongs to and ask if they want to contribute their text to the Public Domain. If they want to, help them go through the <cc0WaiverLink>Contributions Agreement</cc0WaiverLink> process. If they do not want to contribute the text, then you are not allowed to use that text.
tn: Gopola gore re tlhoka tetla ya go phasalatsa dipolelo tseo, ka jalo ka metlha tlhomamisa gore mokwalo ke wa <wikipediaLink>lefelong la botlhe</wikipediaLink>. Fa go se na sepe se se bontshang ka tlhamalalo, ikgolaganye le motho yo mokwalo e leng wa gagwe mme o mmotse gore o batla go abela Lefelo la Botlhe mokwalo wa gagwe. Fa a batla go dira jalo, mo thuse gore a tsene mo thulaganyong ya <cc0WaiverLink>Tumalano ya Dikabo</cc0WaiverLink>. Fa a sa batle go aba mokwalo oo, ga o letlelelwe go o dirisa.

source: remove
tn: tlosa

source: Remove
tn: Tlosa

source: Remove Avatar
tn: Ntsha Setshwantsho

source: Report
tn: Bega
